micropython/micropython/stmhal/cmsis/stm32f769xx.h
/********************  Bit definition for SR register  *******************/
#define  JPEG_SR_IFTF                            0x00000002U        /*!<Input FIFO is not full and is bellow its threshold flag */
#define  JPEG_SR_IFNFF                           0x00000004U        /*!<Input FIFO Not Full Flag, a data can be written */
#define  JPEG_SR_OFTF                            0x00000008U        /*!<Output FIFO is not empty and has reach its threshold */
#define  JPEG_SR_OFNEF                           0x000000010U       /*!<Output FIFO is not empty, a data is available */
#define  JPEG_SR_EOCF                            0x000000020U       /*!<JPEG Codec core has finished the encoding or the decoding process and than last data has been sent to the output FIFO */
#define  JPEG_SR_HPDF                            0x000000040U       /*!<JPEG Codec has finished the parsing of the headers and the internal registers have been updated */
#define  JPEG_SR_COF                             0x000000080U       /*!<JPEG Codec operation on going  flag */

/********************  Bit definition for CFR register  *******************/
#define  JPEG_CFR_CEOCF                          0x00000020U       /*!<Clear End of Conversion Flag */
#define  JPEG_CFR_CHPDF                          0x00000040U       /*!<Clear Header Parsing Done Flag */

/********************  Bit definition for DIR register  ********************/
#define  JPEG_DIR_DATAIN                         0xFFFFFFFFU        /*!<Data Input FIFO */

/********************  Bit definition for DOR register  ********************/
#define  JPEG_DOR_DATAOUT                        0xFFFFFFFFU        /*!<Data Output FIFO */

/******************************************************************************/
/*                                                                            */
/*                                MDIOS                                        */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for MDIOS_CR register  *******************/
#define MDIOS_CR_EN               0x00000001U    /*!<Peripheral enable */
#define MDIOS_CR_WRIE             0x00000002U    /*!<Register write interrupt enable */ 
#define MDIOS_CR_RDIE             0x00000004U    /*!<Register Read Interrupt Enable */
#define MDIOS_CR_EIE              0x00000008U    /*!<Error interrupt enable */
#define MDIOS_CR_DPC              0x00000080U    /*!<Disable Preamble Check */
#define MDIOS_CR_PORT_ADDRESS     0x00001F00U    /*!<PORT_ADDRESS[4:0] bits */
#define MDIOS_CR_PORT_ADDRESS_0   0x00000100U    /*!<Bit 0 */
#define MDIOS_CR_PORT_ADDRESS_1   0x00000200U    /*!<Bit 1 */
#define MDIOS_CR_PORT_ADDRESS_2   0x00000400U    /*!<Bit 2 */
#define MDIOS_CR_PORT_ADDRESS_3   0x00000800U    /*!<Bit 3 */
#define MDIOS_CR_PORT_ADDRESS_4   0x00001000U    /*!<Bit 4 */

/********************  Bit definition for MDIOS_WRFR register  *******************/
#define MDIOS_WRFR_WRF            0xFFFFFFFFU    /*!<WRF[31:0] bits (Write flags for MDIO register 0 to 31) */

/********************  Bit definition for MDIOS_CWRFR register  *******************/
#define MDIOS_CWRFR_CWRF           0xFFFFFFFFU    /*!<CWRF[31:0] bits (Clear the write flag for MDIO register 0 to 31) */

/********************  Bit definition for MDIOS_RDFR register  *******************/
#define MDIOS_RDFR_RDF           0xFFFFFFFFU      /*!<RDF[31:0] bits (Read flags for MDIO registers 0 to 31) */

/********************  Bit definition for MDIOS_CRDFR register  *******************/
#define MDIOS_CRDFR_CRDF          0xFFFFFFFFU      /*!<CRDF[31:0] bits (Clear the read flag for MDIO registers 0 to 31) */

/********************  Bit definition for MDIOS_SR register  *******************/
#define MDIOS_SR_PERF             0x00000001U    /*!< Preamble error flag */
#define MDIOS_SR_SERF             0x00000002U    /*!< Start error flag */
#define MDIOS_SR_TERF             0x00000004U    /*!< Turnaround error flag */

/********************  Bit definition for MDIOS_CLRFR register  *******************/
#define MDIOS_CLRFR_CPERF             0x00000001U    /*!< Clear the preamble error flag */
#define MDIOS_CLRFR_CSERF             0x00000002U    /*!< Clear the start error flag */
#define MDIOS_CLRFR_CTERF             0x00000004U    /*!< Clear the turnaround error flag */

/******************************************************************************/
/*                                                                            */
/*                     Display Serial Interface (DSI)                         */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for DSI_VR register  *****************/
#define DSI_VR                         0x3133302AU               /*!< DSI Host Version */

/*******************  Bit definition for DSI_CR register  *****************/
#define DSI_CR_EN                      0x00000001U               /*!< DSI Host power up and reset */

/*******************  Bit definition for DSI_CCR register  ****************/
#define DSI_CCR_TXECKDIV               0x000000FFU               /*!< TX Escape Clock Division */
#define DSI_CCR_TXECKDIV0              0x00000001U
#define DSI_CCR_TXECKDIV1              0x00000002U
#define DSI_CCR_TXECKDIV2              0x00000004U
#define DSI_CCR_TXECKDIV3              0x00000008U
#define DSI_CCR_TXECKDIV4              0x00000010U
#define DSI_CCR_TXECKDIV5              0x00000020U
#define DSI_CCR_TXECKDIV6              0x00000040U
#define DSI_CCR_TXECKDIV7              0x00000080U

#define DSI_CCR_TOCKDIV                0x0000FF00U               /*!< Timeout Clock Division */
#define DSI_CCR_TOCKDIV0               0x00000100U
#define DSI_CCR_TOCKDIV1               0x00000200U
#define DSI_CCR_TOCKDIV2               0x00000400U
#define DSI_CCR_TOCKDIV3               0x00000800U
#define DSI_CCR_TOCKDIV4               0x00001000U
#define DSI_CCR_TOCKDIV5               0x00002000U
#define DSI_CCR_TOCKDIV6               0x00004000U
#define DSI_CCR_TOCKDIV7               0x00008000U

/*******************  Bit definition for DSI_LVCIDR register  *************/
#define DSI_LVCIDR_VCID                0x00000003U               /*!< Virtual Channel ID */
#define DSI_LVCIDR_VCID0               0x00000001U
#define DSI_LVCIDR_VCID1               0x00000002U

/*******************  Bit definition for DSI_LCOLCR register  *************/
#define DSI_LCOLCR_COLC                0x0000000FU               /*!< Color Coding */
#define DSI_LCOLCR_COLC0               0x00000001U
#define DSI_LCOLCR_COLC1               0x00000020U
#define DSI_LCOLCR_COLC2               0x00000040U
#define DSI_LCOLCR_COLC3               0x00000080U

