micropython/micropython/stmhal/cmsis/stm32f769xx.h
#define DSI_GHCR_WCMSB                 0x00FF0000U               /*!< WordCount MSB */
#define DSI_GHCR_WCMSB0                0x00010000U
#define DSI_GHCR_WCMSB1                0x00020000U
#define DSI_GHCR_WCMSB2                0x00040000U
#define DSI_GHCR_WCMSB3                0x00080000U
#define DSI_GHCR_WCMSB4                0x00100000U
#define DSI_GHCR_WCMSB5                0x00200000U
#define DSI_GHCR_WCMSB6                0x00400000U
#define DSI_GHCR_WCMSB7                0x00800000U

/*******************  Bit definition for DSI_GPDR register  ***************/
#define DSI_GPDR_DATA1                 0x000000FFU               /*!< Payload Byte 1 */
#define DSI_GPDR_DATA1_0               0x00000001U
#define DSI_GPDR_DATA1_1               0x00000002U
#define DSI_GPDR_DATA1_2               0x00000004U
#define DSI_GPDR_DATA1_3               0x00000008U
#define DSI_GPDR_DATA1_4               0x00000010U
#define DSI_GPDR_DATA1_5               0x00000020U
#define DSI_GPDR_DATA1_6               0x00000040U
#define DSI_GPDR_DATA1_7               0x00000080U

#define DSI_GPDR_DATA2                 0x0000FF00U               /*!< Payload Byte 2 */
#define DSI_GPDR_DATA2_0               0x00000100U
#define DSI_GPDR_DATA2_1               0x00000200U
#define DSI_GPDR_DATA2_2               0x00000400U
#define DSI_GPDR_DATA2_3               0x00000800U
#define DSI_GPDR_DATA2_4               0x00001000U
#define DSI_GPDR_DATA2_5               0x00002000U
#define DSI_GPDR_DATA2_6               0x00004000U
#define DSI_GPDR_DATA2_7               0x00008000U

#define DSI_GPDR_DATA3                 0x00FF0000U               /*!< Payload Byte 3 */
#define DSI_GPDR_DATA3_0               0x00010000U
#define DSI_GPDR_DATA3_1               0x00020000U
#define DSI_GPDR_DATA3_2               0x00040000U
#define DSI_GPDR_DATA3_3               0x00080000U
#define DSI_GPDR_DATA3_4               0x00100000U
#define DSI_GPDR_DATA3_5               0x00200000U
#define DSI_GPDR_DATA3_6               0x00400000U
#define DSI_GPDR_DATA3_7               0x00800000U

#define DSI_GPDR_DATA4                 0xFF000000U               /*!< Payload Byte 4 */
#define DSI_GPDR_DATA4_0               0x01000000U
#define DSI_GPDR_DATA4_1               0x02000000U
#define DSI_GPDR_DATA4_2               0x04000000U
#define DSI_GPDR_DATA4_3               0x08000000U
#define DSI_GPDR_DATA4_4               0x10000000U
#define DSI_GPDR_DATA4_5               0x20000000U
#define DSI_GPDR_DATA4_6               0x40000000U
#define DSI_GPDR_DATA4_7               0x80000000U

/*******************  Bit definition for DSI_GPSR register  ***************/
#define DSI_GPSR_CMDFE                 0x00000001U               /*!< Command FIFO Empty */
#define DSI_GPSR_CMDFF                 0x00000002U               /*!< Command FIFO Full */
#define DSI_GPSR_PWRFE                 0x00000004U               /*!< Payload Write FIFO Empty */
#define DSI_GPSR_PWRFF                 0x00000008U               /*!< Payload Write FIFO Full */
#define DSI_GPSR_PRDFE                 0x00000010U               /*!< Payload Read FIFO Empty */
#define DSI_GPSR_PRDFF                 0x00000020U               /*!< Payload Read FIFO Full */
#define DSI_GPSR_RCB                   0x00000040U               /*!< Read Command Busy */

/*******************  Bit definition for DSI_TCCR0register  **************/
#define DSI_TCCR0_LPRX_TOCNT           0x0000FFFFU               /*!< Low-power Reception Timeout Counter */
#define DSI_TCCR0_LPRX_TOCNT0          0x00000001U
#define DSI_TCCR0_LPRX_TOCNT1          0x00000002U
#define DSI_TCCR0_LPRX_TOCNT2          0x00000004U
#define DSI_TCCR0_LPRX_TOCNT3          0x00000008U
#define DSI_TCCR0_LPRX_TOCNT4          0x00000010U
#define DSI_TCCR0_LPRX_TOCNT5          0x00000020U
#define DSI_TCCR0_LPRX_TOCNT6          0x00000040U
#define DSI_TCCR0_LPRX_TOCNT7          0x00000080U
#define DSI_TCCR0_LPRX_TOCNT8          0x00000100U
#define DSI_TCCR0_LPRX_TOCNT9          0x00000200U
#define DSI_TCCR0_LPRX_TOCNT10         0x00000400U
#define DSI_TCCR0_LPRX_TOCNT11         0x00000800U
#define DSI_TCCR0_LPRX_TOCNT12         0x00001000U
#define DSI_TCCR0_LPRX_TOCNT13         0x00002000U
#define DSI_TCCR0_LPRX_TOCNT14         0x00004000U
#define DSI_TCCR0_LPRX_TOCNT15         0x00008000U

#define DSI_TCCR0_HSTX_TOCNT           0xFFFF0000U               /*!< High-Speed Transmission Timeout Counter */
#define DSI_TCCR0_HSTX_TOCNT0          0x00010000U
#define DSI_TCCR0_HSTX_TOCNT1          0x00020000U
#define DSI_TCCR0_HSTX_TOCNT2          0x00040000U
#define DSI_TCCR0_HSTX_TOCNT3          0x00080000U
#define DSI_TCCR0_HSTX_TOCNT4          0x00100000U
#define DSI_TCCR0_HSTX_TOCNT5          0x00200000U
#define DSI_TCCR0_HSTX_TOCNT6          0x00400000U
#define DSI_TCCR0_HSTX_TOCNT7          0x00800000U
#define DSI_TCCR0_HSTX_TOCNT8          0x01000000U
#define DSI_TCCR0_HSTX_TOCNT9          0x02000000U
#define DSI_TCCR0_HSTX_TOCNT10         0x04000000U
#define DSI_TCCR0_HSTX_TOCNT11         0x08000000U
#define DSI_TCCR0_HSTX_TOCNT12         0x10000000U
#define DSI_TCCR0_HSTX_TOCNT13         0x20000000U
#define DSI_TCCR0_HSTX_TOCNT14         0x40000000U
#define DSI_TCCR0_HSTX_TOCNT15         0x80000000U

/*******************  Bit definition for DSI_TCCR1register  **************/
#define DSI_TCCR1_HSRD_TOCNT           0x0000FFFFU               /*!< High-Speed Read Timeout Counter */
#define DSI_TCCR1_HSRD_TOCNT0          0x00000001U
#define DSI_TCCR1_HSRD_TOCNT1          0x00000002U
#define DSI_TCCR1_HSRD_TOCNT2          0x00000004U
#define DSI_TCCR1_HSRD_TOCNT3          0x00000008U
#define DSI_TCCR1_HSRD_TOCNT4          0x00000010U
#define DSI_TCCR1_HSRD_TOCNT5          0x00000020U
#define DSI_TCCR1_HSRD_TOCNT6          0x00000040U
#define DSI_TCCR1_HSRD_TOCNT7          0x00000080U
#define DSI_TCCR1_HSRD_TOCNT8          0x00000100U
#define DSI_TCCR1_HSRD_TOCNT9          0x00000200U
#define DSI_TCCR1_HSRD_TOCNT10         0x00000400U
#define DSI_TCCR1_HSRD_TOCNT11         0x00000800U
#define DSI_TCCR1_HSRD_TOCNT12         0x00001000U
#define DSI_TCCR1_HSRD_TOCNT13         0x00002000U
#define DSI_TCCR1_HSRD_TOCNT14         0x00004000U
#define DSI_TCCR1_HSRD_TOCNT15         0x00008000U

/*******************  Bit definition for DSI_TCCR2 register  **************/
#define DSI_TCCR2_LPRD_TOCNT           0x0000FFFFU               /*!< Low-Power Read Timeout Counter */
#define DSI_TCCR2_LPRD_TOCNT0          0x00000001U
#define DSI_TCCR2_LPRD_TOCNT1          0x00000002U
#define DSI_TCCR2_LPRD_TOCNT2          0x00000004U
#define DSI_TCCR2_LPRD_TOCNT3          0x00000008U
#define DSI_TCCR2_LPRD_TOCNT4          0x00000010U
#define DSI_TCCR2_LPRD_TOCNT5          0x00000020U
#define DSI_TCCR2_LPRD_TOCNT6          0x00000040U
#define DSI_TCCR2_LPRD_TOCNT7          0x00000080U
#define DSI_TCCR2_LPRD_TOCNT8          0x00000100U
#define DSI_TCCR2_LPRD_TOCNT9          0x00000200U
#define DSI_TCCR2_LPRD_TOCNT10         0x00000400U
#define DSI_TCCR2_LPRD_TOCNT11         0x00000800U
#define DSI_TCCR2_LPRD_TOCNT12         0x00001000U
#define DSI_TCCR2_LPRD_TOCNT13         0x00002000U
#define DSI_TCCR2_LPRD_TOCNT14         0x00004000U
#define DSI_TCCR2_LPRD_TOCNT15         0x00008000U

