micropython/micropython/stmhal/cmsis/stm32f769xx.h
/*******************  Bit definition for DSI_TCCR3 register  **************/
#define DSI_TCCR3_HSWR_TOCNT           0x0000FFFFU               /*!< High-Speed Write Timeout Counter */
#define DSI_TCCR3_HSWR_TOCNT0          0x00000001U
#define DSI_TCCR3_HSWR_TOCNT1          0x00000002U
#define DSI_TCCR3_HSWR_TOCNT2          0x00000004U
#define DSI_TCCR3_HSWR_TOCNT3          0x00000008U
#define DSI_TCCR3_HSWR_TOCNT4          0x00000010U
#define DSI_TCCR3_HSWR_TOCNT5          0x00000020U
#define DSI_TCCR3_HSWR_TOCNT6          0x00000040U
#define DSI_TCCR3_HSWR_TOCNT7          0x00000080U
#define DSI_TCCR3_HSWR_TOCNT8          0x00000100U
#define DSI_TCCR3_HSWR_TOCNT9          0x00000200U
#define DSI_TCCR3_HSWR_TOCNT10         0x00000400U
#define DSI_TCCR3_HSWR_TOCNT11         0x00000800U
#define DSI_TCCR3_HSWR_TOCNT12         0x00001000U
#define DSI_TCCR3_HSWR_TOCNT13         0x00002000U
#define DSI_TCCR3_HSWR_TOCNT14         0x00004000U
#define DSI_TCCR3_HSWR_TOCNT15         0x00008000U

#define DSI_TCCR3_PM                   0x01000000U               /*!< Presp Mode */

/*******************  Bit definition for DSI_TCCR4 register  **************/
#define DSI_TCCR4_LPWR_TOCNT           0x0000FFFFU               /*!< Low-Power Write Timeout Counter */
#define DSI_TCCR4_LPWR_TOCNT0          0x00000001U
#define DSI_TCCR4_LPWR_TOCNT1          0x00000002U
#define DSI_TCCR4_LPWR_TOCNT2          0x00000004U
#define DSI_TCCR4_LPWR_TOCNT3          0x00000008U
#define DSI_TCCR4_LPWR_TOCNT4          0x00000010U
#define DSI_TCCR4_LPWR_TOCNT5          0x00000020U
#define DSI_TCCR4_LPWR_TOCNT6          0x00000040U
#define DSI_TCCR4_LPWR_TOCNT7          0x00000080U
#define DSI_TCCR4_LPWR_TOCNT8          0x00000100U
#define DSI_TCCR4_LPWR_TOCNT9          0x00000200U
#define DSI_TCCR4_LPWR_TOCNT10         0x00000400U
#define DSI_TCCR4_LPWR_TOCNT11         0x00000800U
#define DSI_TCCR4_LPWR_TOCNT12         0x00001000U
#define DSI_TCCR4_LPWR_TOCNT13         0x00002000U
#define DSI_TCCR4_LPWR_TOCNT14         0x00004000U
#define DSI_TCCR4_LPWR_TOCNT15         0x00008000U

/*******************  Bit definition for DSI_TCCR5register  **************/
#define DSI_TCCR5_BTA_TOCNT            0x0000FFFFU               /*!< Bus-Turn-Around Timeout Counter */
#define DSI_TCCR5_BTA_TOCNT0           0x00000001U
#define DSI_TCCR5_BTA_TOCNT1           0x00000002U
#define DSI_TCCR5_BTA_TOCNT2           0x00000004U
#define DSI_TCCR5_BTA_TOCNT3           0x00000008U
#define DSI_TCCR5_BTA_TOCNT4           0x00000010U
#define DSI_TCCR5_BTA_TOCNT5           0x00000020U
#define DSI_TCCR5_BTA_TOCNT6           0x00000040U
#define DSI_TCCR5_BTA_TOCNT7           0x00000080U
#define DSI_TCCR5_BTA_TOCNT8           0x00000100U
#define DSI_TCCR5_BTA_TOCNT9           0x00000200U
#define DSI_TCCR5_BTA_TOCNT10          0x00000400U
#define DSI_TCCR5_BTA_TOCNT11          0x00000800U
#define DSI_TCCR5_BTA_TOCNT12          0x00001000U
#define DSI_TCCR5_BTA_TOCNT13          0x00002000U
#define DSI_TCCR5_BTA_TOCNT14          0x00004000U
#define DSI_TCCR5_BTA_TOCNT15          0x00008000U

/*******************  Bit definition for DSI_TDCR register  ***************/
#define DSI_TDCR_3DM                   0x00000003U               /*!< 3D Mode */
#define DSI_TDCR_3DM0                  0x00000001U
#define DSI_TDCR_3DM1                  0x00000002U

#define DSI_TDCR_3DF                   0x0000000CU               /*!< 3D Format */
#define DSI_TDCR_3DF0                  0x00000004U
#define DSI_TDCR_3DF1                  0x00000008U

#define DSI_TDCR_SVS                   0x00000010U               /*!< Second VSYNC */
#define DSI_TDCR_RF                    0x00000020U               /*!< Right First */
#define DSI_TDCR_S3DC                  0x00010000U               /*!< Send 3D Control */

/*******************  Bit definition for DSI_CLCR register  ***************/
#define DSI_CLCR_DPCC                  0x00000001U               /*!< D-PHY Clock Control */
#define DSI_CLCR_ACR                   0x00000002U               /*!< Automatic Clocklane Control */

/*******************  Bit definition for DSI_CLTCR register  **************/
#define DSI_CLTCR_LP2HS_TIME           0x000003FFU               /*!< Low-Power to High-Speed Time */
#define DSI_CLTCR_LP2HS_TIME0          0x00000001U
#define DSI_CLTCR_LP2HS_TIME1          0x00000002U
#define DSI_CLTCR_LP2HS_TIME2          0x00000004U
#define DSI_CLTCR_LP2HS_TIME3          0x00000008U
#define DSI_CLTCR_LP2HS_TIME4          0x00000010U
#define DSI_CLTCR_LP2HS_TIME5          0x00000020U
#define DSI_CLTCR_LP2HS_TIME6          0x00000040U
#define DSI_CLTCR_LP2HS_TIME7          0x00000080U
#define DSI_CLTCR_LP2HS_TIME8          0x00000100U
#define DSI_CLTCR_LP2HS_TIME9          0x00000200U

#define DSI_CLTCR_HS2LP_TIME           0x03FF0000U               /*!< High-Speed to Low-Power Time */
#define DSI_CLTCR_HS2LP_TIME0          0x00010000U
#define DSI_CLTCR_HS2LP_TIME1          0x00020000U
#define DSI_CLTCR_HS2LP_TIME2          0x00040000U
#define DSI_CLTCR_HS2LP_TIME3          0x00080000U
#define DSI_CLTCR_HS2LP_TIME4          0x00100000U
#define DSI_CLTCR_HS2LP_TIME5          0x00200000U
#define DSI_CLTCR_HS2LP_TIME6          0x00400000U
#define DSI_CLTCR_HS2LP_TIME7          0x00800000U
#define DSI_CLTCR_HS2LP_TIME8          0x01000000U
#define DSI_CLTCR_HS2LP_TIME9          0x02000000U

/*******************  Bit definition for DSI_DLTCR register  **************/
#define DSI_DLTCR_MRD_TIME             0x00007FFFU               /*!< Maximum Read Time */
#define DSI_DLTCR_MRD_TIME0            0x00000001U
#define DSI_DLTCR_MRD_TIME1            0x00000002U
#define DSI_DLTCR_MRD_TIME2            0x00000004U
#define DSI_DLTCR_MRD_TIME3            0x00000008U
#define DSI_DLTCR_MRD_TIME4            0x00000010U
#define DSI_DLTCR_MRD_TIME5            0x00000020U
#define DSI_DLTCR_MRD_TIME6            0x00000040U
#define DSI_DLTCR_MRD_TIME7            0x00000080U
#define DSI_DLTCR_MRD_TIME8            0x00000100U
#define DSI_DLTCR_MRD_TIME9            0x00000200U
#define DSI_DLTCR_MRD_TIME10           0x00000400U
#define DSI_DLTCR_MRD_TIME11           0x00000800U
#define DSI_DLTCR_MRD_TIME12           0x00001000U
#define DSI_DLTCR_MRD_TIME13           0x00002000U
#define DSI_DLTCR_MRD_TIME14           0x00004000U

#define DSI_DLTCR_LP2HS_TIME           0x00FF0000U               /*!< Low-Power To High-Speed Time */
#define DSI_DLTCR_LP2HS_TIME0          0x00010000U
#define DSI_DLTCR_LP2HS_TIME1          0x00020000U
#define DSI_DLTCR_LP2HS_TIME2          0x00040000U
#define DSI_DLTCR_LP2HS_TIME3          0x00080000U
#define DSI_DLTCR_LP2HS_TIME4          0x00100000U
#define DSI_DLTCR_LP2HS_TIME5          0x00200000U
#define DSI_DLTCR_LP2HS_TIME6          0x00400000U
#define DSI_DLTCR_LP2HS_TIME7          0x00800000U

#define DSI_DLTCR_HS2LP_TIME           0xFF000000U               /*!< High-Speed To Low-Power Time */
#define DSI_DLTCR_HS2LP_TIME0          0x01000000U
#define DSI_DLTCR_HS2LP_TIME1          0x02000000U
#define DSI_DLTCR_HS2LP_TIME2          0x04000000U
#define DSI_DLTCR_HS2LP_TIME3          0x08000000U
#define DSI_DLTCR_HS2LP_TIME4          0x10000000U
#define DSI_DLTCR_HS2LP_TIME5          0x20000000U
#define DSI_DLTCR_HS2LP_TIME6          0x40000000U
#define DSI_DLTCR_HS2LP_TIME7          0x80000000U

/*******************  Bit definition for DSI_PCTLRregister  **************/
#define DSI_PCTLR_DEN                  0x00000002U               /*!< Digital Enable */
#define DSI_PCTLR_CKE                  0x00000004U               /*!< Clock Enable */

/*******************  Bit definition for DSI_PCONFR register  *************/
#define DSI_PCONFR_NL                  0x00000003U               /*!< Number of Lanes */
#define DSI_PCONFR_NL0                 0x00000001U
#define DSI_PCONFR_NL1                 0x00000002U

#define DSI_PCONFR_SW_TIME             0x0000FF00U               /*!< Stop Wait Time */
#define DSI_PCONFR_SW_TIME0            0x00000100U
#define DSI_PCONFR_SW_TIME1            0x00000200U
#define DSI_PCONFR_SW_TIME2            0x00000400U
#define DSI_PCONFR_SW_TIME3            0x00000800U
#define DSI_PCONFR_SW_TIME4            0x00001000U
#define DSI_PCONFR_SW_TIME5            0x00002000U
#define DSI_PCONFR_SW_TIME6            0x00004000U
#define DSI_PCONFR_SW_TIME7            0x00008000U

/*******************  Bit definition for DSI_PUCR register  ***************/
#define DSI_PUCR_URCL                  0x00000001U               /*!< ULPS Request on Clock Lane */
#define DSI_PUCR_UECL                  0x00000002U               /*!< ULPS Exit on Clock Lane */
#define DSI_PUCR_URDL                  0x00000004U               /*!< ULPS Request on Data Lane */
#define DSI_PUCR_UEDL                  0x00000008U               /*!< ULPS Exit on Data Lane */

/*******************  Bit definition for DSI_PTTCRregister  **************/
#define DSI_PTTCR_TX_TRIG              0x0000000FU               /*!< Transmission Trigger */
#define DSI_PTTCR_TX_TRIG0             0x00000001U
#define DSI_PTTCR_TX_TRIG1             0x00000002U
#define DSI_PTTCR_TX_TRIG2             0x00000004U
#define DSI_PTTCR_TX_TRIG3             0x00000008U

