micropython/micropython/stmhal/cmsis/stm32f769xx.h
/*******************  Bit definition for DSI_LPMCCR register  *************/
#define DSI_LPMCCR_VLPSIZE             0x000000FFU               /*!< VACT Largest Packet Size */
#define DSI_LPMCCR_VLPSIZE0            0x00000001U
#define DSI_LPMCCR_VLPSIZE1            0x00000002U
#define DSI_LPMCCR_VLPSIZE2            0x00000004U
#define DSI_LPMCCR_VLPSIZE3            0x00000008U
#define DSI_LPMCCR_VLPSIZE4            0x00000010U
#define DSI_LPMCCR_VLPSIZE5            0x00000020U
#define DSI_LPMCCR_VLPSIZE6            0x00000040U
#define DSI_LPMCCR_VLPSIZE7            0x00000080U

#define DSI_LPMCCR_LPSIZE              0x00FF0000U               /*!< Largest Packet Size */
#define DSI_LPMCCR_LPSIZE0             0x00010000U
#define DSI_LPMCCR_LPSIZE1             0x00020000U
#define DSI_LPMCCR_LPSIZE2             0x00040000U
#define DSI_LPMCCR_LPSIZE3             0x00080000U
#define DSI_LPMCCR_LPSIZE4             0x00100000U
#define DSI_LPMCCR_LPSIZE5             0x00200000U
#define DSI_LPMCCR_LPSIZE6             0x00400000U
#define DSI_LPMCCR_LPSIZE7             0x00800000U

/*******************  Bit definition for DSI_VMCCR register  **************/
#define DSI_VMCCR_VMT                  0x00000003U               /*!< Video Mode Type */
#define DSI_VMCCR_VMT0                 0x00000001U
#define DSI_VMCCR_VMT1                 0x00000002U

#define DSI_VMCCR_LPVSAE               0x00000100U               /*!< Low-power Vertical Sync time Enable */
#define DSI_VMCCR_LPVBPE               0x00000200U               /*!< Low-power Vertical Back-porch Enable */
#define DSI_VMCCR_LPVFPE               0x00000400U               /*!< Low-power Vertical Front-porch Enable */
#define DSI_VMCCR_LPVAE                0x00000800U               /*!< Low-power Vertical Active Enable */
#define DSI_VMCCR_LPHBPE               0x00001000U               /*!< Low-power Horizontal Back-porch Enable */
#define DSI_VMCCR_LPHFE                0x00002000U               /*!< Low-power Horizontal Front-porch Enable */
#define DSI_VMCCR_FBTAAE               0x00004000U               /*!< Frame BTA Acknowledge Enable */
#define DSI_VMCCR_LPCE                 0x00008000U               /*!< Low-power Command Enable */

/*******************  Bit definition for DSI_VPCCR register  **************/
#define DSI_VPCCR_VPSIZE               0x00003FFFU               /*!< Video Packet Size */
#define DSI_VPCCR_VPSIZE0              0x00000001U
#define DSI_VPCCR_VPSIZE1              0x00000002U
#define DSI_VPCCR_VPSIZE2              0x00000004U
#define DSI_VPCCR_VPSIZE3              0x00000008U
#define DSI_VPCCR_VPSIZE4              0x00000010U
#define DSI_VPCCR_VPSIZE5              0x00000020U
#define DSI_VPCCR_VPSIZE6              0x00000040U
#define DSI_VPCCR_VPSIZE7              0x00000080U
#define DSI_VPCCR_VPSIZE8              0x00000100U
#define DSI_VPCCR_VPSIZE9              0x00000200U
#define DSI_VPCCR_VPSIZE10             0x00000400U
#define DSI_VPCCR_VPSIZE11             0x00000800U
#define DSI_VPCCR_VPSIZE12             0x00001000U
#define DSI_VPCCR_VPSIZE13             0x00002000U

/*******************  Bit definition for DSI_VCCCR register  **************/
#define DSI_VCCCR_NUMC                 0x00001FFFU               /*!< Number of Chunks */
#define DSI_VCCCR_NUMC0                0x00000001U
#define DSI_VCCCR_NUMC1                0x00000002U
#define DSI_VCCCR_NUMC2                0x00000004U
#define DSI_VCCCR_NUMC3                0x00000008U
#define DSI_VCCCR_NUMC4                0x00000010U
#define DSI_VCCCR_NUMC5                0x00000020U
#define DSI_VCCCR_NUMC6                0x00000040U
#define DSI_VCCCR_NUMC7                0x00000080U
#define DSI_VCCCR_NUMC8                0x00000100U
#define DSI_VCCCR_NUMC9                0x00000200U
#define DSI_VCCCR_NUMC10               0x00000400U
#define DSI_VCCCR_NUMC11               0x00000800U
#define DSI_VCCCR_NUMC12               0x00001000U

/*******************  Bit definition for DSI_VNPCCR register  *************/
#define DSI_VNPCCR_NPSIZE              0x00001FFFU               /*!< Number of Chunks */
#define DSI_VNPCCR_NPSIZE0             0x00000001U
#define DSI_VNPCCR_NPSIZE1             0x00000002U
#define DSI_VNPCCR_NPSIZE2             0x00000004U
#define DSI_VNPCCR_NPSIZE3             0x00000008U
#define DSI_VNPCCR_NPSIZE4             0x00000010U
#define DSI_VNPCCR_NPSIZE5             0x00000020U
#define DSI_VNPCCR_NPSIZE6             0x00000040U
#define DSI_VNPCCR_NPSIZE7             0x00000080U
#define DSI_VNPCCR_NPSIZE8             0x00000100U
#define DSI_VNPCCR_NPSIZE9             0x00000200U
#define DSI_VNPCCR_NPSIZE10            0x00000400U
#define DSI_VNPCCR_NPSIZE11            0x00000800U
#define DSI_VNPCCR_NPSIZE12            0x00001000U

/*******************  Bit definition for DSI_VHSACCR register  ************/
#define DSI_VHSACCR_HSA                0x00000FFFU               /*!< Horizontal Synchronism Active duration */
#define DSI_VHSACCR_HSA0               0x00000001U
#define DSI_VHSACCR_HSA1               0x00000002U
#define DSI_VHSACCR_HSA2               0x00000004U
#define DSI_VHSACCR_HSA3               0x00000008U
#define DSI_VHSACCR_HSA4               0x00000010U
#define DSI_VHSACCR_HSA5               0x00000020U
#define DSI_VHSACCR_HSA6               0x00000040U
#define DSI_VHSACCR_HSA7               0x00000080U
#define DSI_VHSACCR_HSA8               0x00000100U
#define DSI_VHSACCR_HSA9               0x00000200U
#define DSI_VHSACCR_HSA10              0x00000400U
#define DSI_VHSACCR_HSA11              0x00000800U

/*******************  Bit definition for DSI_VHBPCCR register  ************/
#define DSI_VHBPCCR_HBP                0x00000FFFU               /*!< Horizontal Back-Porch duration */
#define DSI_VHBPCCR_HBP0               0x00000001U
#define DSI_VHBPCCR_HBP1               0x00000002U
#define DSI_VHBPCCR_HBP2               0x00000004U
#define DSI_VHBPCCR_HBP3               0x00000008U
#define DSI_VHBPCCR_HBP4               0x00000010U
#define DSI_VHBPCCR_HBP5               0x00000020U
#define DSI_VHBPCCR_HBP6               0x00000040U
#define DSI_VHBPCCR_HBP7               0x00000080U
#define DSI_VHBPCCR_HBP8               0x00000100U
#define DSI_VHBPCCR_HBP9               0x00000200U
#define DSI_VHBPCCR_HBP10              0x00000400U
#define DSI_VHBPCCR_HBP11              0x00000800U

