micropython/micropython/stmhal/cmsis/stm32f769xx.h
/*******************  Bit definition for DSI_WPCR0 register  ***************/
#define DSI_WPCR0_UIX4                   0x0000003FU              /*!< Unit Interval multiplied by 4 */
#define DSI_WPCR0_UIX4_0                 0x00000001U
#define DSI_WPCR0_UIX4_1                 0x00000002U
#define DSI_WPCR0_UIX4_2                 0x00000004U
#define DSI_WPCR0_UIX4_3                 0x00000008U
#define DSI_WPCR0_UIX4_4                 0x00000010U
#define DSI_WPCR0_UIX4_5                 0x00000020U

#define DSI_WPCR0_SWCL                   0x00000040U              /*!< Swap pins on clock lane */
#define DSI_WPCR0_SWDL0                  0x00000080U              /*!< Swap pins on data lane 1 */
#define DSI_WPCR0_SWDL1                  0x00000100U              /*!< Swap pins on data lane 2 */
#define DSI_WPCR0_HSICL                  0x00000200U              /*!< Invert the high-speed data signal on clock lane */
#define DSI_WPCR0_HSIDL0                 0x00000400U              /*!< Invert the high-speed data signal on lane 1 */
#define DSI_WPCR0_HSIDL1                 0x00000800U              /*!< Invert the high-speed data signal on lane 2 */
#define DSI_WPCR0_FTXSMCL                0x00001000U              /*!< Force clock lane in TX stop mode */
#define DSI_WPCR0_FTXSMDL                0x00002000U              /*!< Force data lanes in TX stop mode */
#define DSI_WPCR0_CDOFFDL                0x00004000U              /*!< Contention detection OFF */
#define DSI_WPCR0_TDDL                   0x00010000U              /*!< Turn Disable Data Lanes */
#define DSI_WPCR0_PDEN                   0x00040000U              /*!< Pull-Down Enable */
#define DSI_WPCR0_TCLKPREPEN             0x00080000U              /*!< Timer for t-CLKPREP Enable */
#define DSI_WPCR0_TCLKZEROEN             0x00100000U              /*!< Timer for t-CLKZERO Enable */
#define DSI_WPCR0_THSPREPEN              0x00200000U              /*!< Timer for t-HSPREP Enable */
#define DSI_WPCR0_THSTRAILEN             0x00400000U              /*!< Timer for t-HSTRAIL Enable */
#define DSI_WPCR0_THSZEROEN              0x00800000U              /*!< Timer for t-HSZERO Enable */
#define DSI_WPCR0_TLPXDEN                0x01000000U              /*!< Timer for t-LPXD Enable */
#define DSI_WPCR0_THSEXITEN              0x02000000U              /*!< Timer for t-HSEXIT Enable */
#define DSI_WPCR0_TLPXCEN                0x04000000U              /*!< Timer for t-LPXC Enable */
#define DSI_WPCR0_TCLKPOSTEN             0x08000000U              /*!< Timer for t-CLKPOST Enable */

/*******************  Bit definition for DSI_WPCR1 register  ***************/
#define DSI_WPCR1_HSTXDCL                0x00000003U              /*!< High-Speed Transmission Delay on Clock Lane */
#define DSI_WPCR1_HSTXDCL0               0x00000001U
#define DSI_WPCR1_HSTXDCL1               0x00000002U

#define DSI_WPCR1_HSTXDDL                0x0000000CU              /*!< High-Speed Transmission Delay on Data Lane */
#define DSI_WPCR1_HSTXDDL0               0x00000004U
#define DSI_WPCR1_HSTXDDL1               0x00000008U

#define DSI_WPCR1_LPSRCCL                0x000000C0U              /*!< Low-Power transmission Slew Rate Compensation on Clock Lane */
#define DSI_WPCR1_LPSRCCL0               0x00000040U
#define DSI_WPCR1_LPSRCCL1               0x00000080U

#define DSI_WPCR1_LPSRCDL                0x00000300U              /*!< Low-Power transmission Slew Rate Compensation on Data Lane */
#define DSI_WPCR1_LPSRCDL0               0x00000100U
#define DSI_WPCR1_LPSRCDL1               0x00000200U

#define DSI_WPCR1_SDDC                   0x00001000U              /*!< SDD Control */

#define DSI_WPCR1_LPRXVCDL               0x0000C000U              /*!< Low-Power Reception V-IL Compensation on Data Lanes */
#define DSI_WPCR1_LPRXVCDL0              0x00004000U
#define DSI_WPCR1_LPRXVCDL1              0x00008000U

#define DSI_WPCR1_HSTXSRCCL              0x00030000U              /*!< High-Speed Transmission Delay on Clock Lane */
#define DSI_WPCR1_HSTXSRCCL0             0x00010000U
#define DSI_WPCR1_HSTXSRCCL1             0x00020000U

#define DSI_WPCR1_HSTXSRCDL              0x000C0000U              /*!< High-Speed Transmission Delay on Data Lane */
#define DSI_WPCR1_HSTXSRCDL0             0x00040000U
#define DSI_WPCR1_HSTXSRCDL1             0x00080000U

#define DSI_WPCR1_FLPRXLPM               0x00400000U              /*!< Forces LP Receiver in Low-Power Mode */

#define DSI_WPCR1_LPRXFT                 0x06000000U              /*!< Low-Power RX low-pass Filtering Tuning */
#define DSI_WPCR1_LPRXFT0                0x02000000U
#define DSI_WPCR1_LPRXFT1                0x04000000U

/*******************  Bit definition for DSI_WPCR2 register  ***************/
#define DSI_WPCR2_TCLKPREP               0x000000FFU              /*!< t-CLKPREP */
#define DSI_WPCR2_TCLKPREP0              0x00000001U
#define DSI_WPCR2_TCLKPREP1              0x00000002U
#define DSI_WPCR2_TCLKPREP2              0x00000004U
#define DSI_WPCR2_TCLKPREP3              0x00000008U
#define DSI_WPCR2_TCLKPREP4              0x00000010U
#define DSI_WPCR2_TCLKPREP5              0x00000020U
#define DSI_WPCR2_TCLKPREP6              0x00000040U
#define DSI_WPCR2_TCLKPREP7              0x00000080U

#define DSI_WPCR2_TCLKZERO               0x0000FF00U              /*!< t-CLKZERO */
#define DSI_WPCR2_TCLKZERO0              0x00000100U
#define DSI_WPCR2_TCLKZERO1              0x00000200U
#define DSI_WPCR2_TCLKZERO2              0x00000400U
#define DSI_WPCR2_TCLKZERO3              0x00000800U
#define DSI_WPCR2_TCLKZERO4              0x00001000U
#define DSI_WPCR2_TCLKZERO5              0x00002000U
#define DSI_WPCR2_TCLKZERO6              0x00004000U
#define DSI_WPCR2_TCLKZERO7              0x00008000U

#define DSI_WPCR2_THSPREP                0x00FF0000U              /*!< t-HSPREP */
#define DSI_WPCR2_THSPREP0               0x00010000U
#define DSI_WPCR2_THSPREP1               0x00020000U
#define DSI_WPCR2_THSPREP2               0x00040000U
#define DSI_WPCR2_THSPREP3               0x00080000U
#define DSI_WPCR2_THSPREP4               0x00100000U
#define DSI_WPCR2_THSPREP5               0x00200000U
#define DSI_WPCR2_THSPREP6               0x00400000U
#define DSI_WPCR2_THSPREP7               0x00800000U

#define DSI_WPCR2_THSTRAIL               0xFF000000U              /*!< t-HSTRAIL */
#define DSI_WPCR2_THSTRAIL0              0x01000000U
#define DSI_WPCR2_THSTRAIL1              0x02000000U
#define DSI_WPCR2_THSTRAIL2              0x04000000U
#define DSI_WPCR2_THSTRAIL3              0x08000000U
#define DSI_WPCR2_THSTRAIL4              0x10000000U
#define DSI_WPCR2_THSTRAIL5              0x20000000U
#define DSI_WPCR2_THSTRAIL6              0x40000000U
#define DSI_WPCR2_THSTRAIL7              0x80000000U

/*******************  Bit definition for DSI_WPCR3 register  ***************/
#define DSI_WPCR3_THSZERO                0x000000FFU              /*!< t-HSZERO */
#define DSI_WPCR3_THSZERO0               0x00000001U
#define DSI_WPCR3_THSZERO1               0x00000002U
#define DSI_WPCR3_THSZERO2               0x00000004U
#define DSI_WPCR3_THSZERO3               0x00000008U
#define DSI_WPCR3_THSZERO4               0x00000010U
#define DSI_WPCR3_THSZERO5               0x00000020U
#define DSI_WPCR3_THSZERO6               0x00000040U
#define DSI_WPCR3_THSZERO7               0x00000080U

#define DSI_WPCR3_TLPXD                  0x0000FF00U              /*!< t-LPXD */
#define DSI_WPCR3_TLPXD0                 0x00000100U
#define DSI_WPCR3_TLPXD1                 0x00000200U
#define DSI_WPCR3_TLPXD2                 0x00000400U
#define DSI_WPCR3_TLPXD3                 0x00000800U
#define DSI_WPCR3_TLPXD4                 0x00001000U
#define DSI_WPCR3_TLPXD5                 0x00002000U
#define DSI_WPCR3_TLPXD6                 0x00004000U
#define DSI_WPCR3_TLPXD7                 0x00008000U

