micropython/micropython/stmhal/cmsis/stm32f769xx.h
#define DSI_WPCR3_THSEXIT                0x00FF0000U              /*!< t-HSEXIT */
#define DSI_WPCR3_THSEXIT0               0x00010000U
#define DSI_WPCR3_THSEXIT1               0x00020000U
#define DSI_WPCR3_THSEXIT2               0x00040000U
#define DSI_WPCR3_THSEXIT3               0x00080000U
#define DSI_WPCR3_THSEXIT4               0x00100000U
#define DSI_WPCR3_THSEXIT5               0x00200000U
#define DSI_WPCR3_THSEXIT6               0x00400000U
#define DSI_WPCR3_THSEXIT7               0x00800000U

#define DSI_WPCR3_TLPXC                  0xFF000000U              /*!< t-LPXC */
#define DSI_WPCR3_TLPXC0                 0x01000000U
#define DSI_WPCR3_TLPXC1                 0x02000000U
#define DSI_WPCR3_TLPXC2                 0x04000000U
#define DSI_WPCR3_TLPXC3                 0x08000000U
#define DSI_WPCR3_TLPXC4                 0x10000000U
#define DSI_WPCR3_TLPXC5                 0x20000000U
#define DSI_WPCR3_TLPXC6                 0x40000000U
#define DSI_WPCR3_TLPXC7                 0x80000000U

/*******************  Bit definition for DSI_WPCR4 register  ***************/
#define DSI_WPCR4_TCLKPOST               0x000000FFU              /*!< t-CLKPOST */
#define DSI_WPCR4_TCLKPOST0              0x00000001U
#define DSI_WPCR4_TCLKPOST1              0x00000002U
#define DSI_WPCR4_TCLKPOST2              0x00000004U
#define DSI_WPCR4_TCLKPOST3              0x00000008U
#define DSI_WPCR4_TCLKPOST4              0x00000010U
#define DSI_WPCR4_TCLKPOST5              0x00000020U
#define DSI_WPCR4_TCLKPOST6              0x00000040U
#define DSI_WPCR4_TCLKPOST7              0x00000080U

/*******************  Bit definition for DSI_WRPCR register  ***************/
#define DSI_WRPCR_PLLEN                  0x00000001U              /*!< PLL Enable */
#define DSI_WRPCR_PLL_NDIV               0x000001FCU              /*!< PLL Loop Division Factor */
#define DSI_WRPCR_PLL_NDIV0              0x00000004U
#define DSI_WRPCR_PLL_NDIV1              0x00000008U
#define DSI_WRPCR_PLL_NDIV2              0x00000010U
#define DSI_WRPCR_PLL_NDIV3              0x00000020U
#define DSI_WRPCR_PLL_NDIV4              0x00000040U
#define DSI_WRPCR_PLL_NDIV5              0x00000080U
#define DSI_WRPCR_PLL_NDIV6              0x00000100U

#define DSI_WRPCR_PLL_IDF                0x00007800U              /*!< PLL Input Division Factor */
#define DSI_WRPCR_PLL_IDF0               0x00000800U
#define DSI_WRPCR_PLL_IDF1               0x00001000U
#define DSI_WRPCR_PLL_IDF2               0x00002000U
#define DSI_WRPCR_PLL_IDF3               0x00004000U

#define DSI_WRPCR_PLL_ODF                0x00030000U              /*!< PLL Output Division Factor */
#define DSI_WRPCR_PLL_ODF0               0x00010000U
#define DSI_WRPCR_PLL_ODF1               0x00020000U

#define DSI_WRPCR_REGEN                  0x01000000U              /*!< Regulator Enable */

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup Exported_macros
  * @{
  */

/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(__INSTANCE__) (((__INSTANCE__) == ADC1) || \
                                       ((__INSTANCE__) == ADC2) || \
                                       ((__INSTANCE__) == ADC3))

/******************************* CAN Instances ********************************/
#define IS_CAN_ALL_INSTANCE(__INSTANCE__) (((__INSTANCE__) == CAN1) || \
                                           ((__INSTANCE__) == CAN2) || \
									       ((__INSTANCE__) == CAN3))
/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(__INSTANCE__) ((__INSTANCE__) == CRC)

/******************************* DAC Instances ********************************/
#define IS_DAC_ALL_INSTANCE(__INSTANCE__) ((__INSTANCE__) == DAC)

/******************************* DCMI Instances *******************************/
#define IS_DCMI_ALL_INSTANCE(__INSTANCE__) ((__INSTANCE__) == DCMI)

/****************************** DFSDM Instances *******************************/
#define IS_DFSDM_FILTER_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DFSDM1_Filter0) || \
                                                ((INSTANCE) == DFSDM1_Filter1) || \
                                                ((INSTANCE) == DFSDM1_Filter2) || \
                                                ((INSTANCE) == DFSDM1_Filter3))

#define IS_DFSDM_CHANNEL_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DFSDM1_Channel0) || \
                                                 ((INSTANCE) == DFSDM1_Channel1) || \
                                                 ((INSTANCE) == DFSDM1_Channel2) || \
                                                 ((INSTANCE) == DFSDM1_Channel3) || \
                                                 ((INSTANCE) == DFSDM1_Channel4) || \
                                                 ((INSTANCE) == DFSDM1_Channel5) || \
                                                 ((INSTANCE) == DFSDM1_Channel6) || \
                                                 ((INSTANCE) == DFSDM1_Channel7))

/******************************* DMA2D Instances *******************************/
#define IS_DMA2D_ALL_INSTANCE(__INSTANCE__) ((__INSTANCE__) == DMA2D)

/******************************** DMA Instances *******************************/
#define IS_DMA_STREAM_ALL_INSTANCE(__INSTANCE__) (((__INSTANCE__) == DMA1_Stream0) || \
                                              ((__INSTANCE__) == DMA1_Stream1) || \
                                              ((__INSTANCE__) == DMA1_Stream2) || \
                                              ((__INSTANCE__) == DMA1_Stream3) || \
                                              ((__INSTANCE__) == DMA1_Stream4) || \
                                              ((__INSTANCE__) == DMA1_Stream5) || \
                                              ((__INSTANCE__) == DMA1_Stream6) || \
                                              ((__INSTANCE__) == DMA1_Stream7) || \
                                              ((__INSTANCE__) == DMA2_Stream0) || \
                                              ((__INSTANCE__) == DMA2_Stream1) || \
                                              ((__INSTANCE__) == DMA2_Stream2) || \
                                              ((__INSTANCE__) == DMA2_Stream3) || \
                                              ((__INSTANCE__) == DMA2_Stream4) || \
                                              ((__INSTANCE__) == DMA2_Stream5) || \
                                              ((__INSTANCE__) == DMA2_Stream6) || \
                                              ((__INSTANCE__) == DMA2_Stream7))

